---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.CannotSetParameter
source: html/7c637c2f-e565-6742-2e56-9a7d63bd21c6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.CannotSetParameter Property

Cant set parameter

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotSetParameter { get; }
```